lavfi-scope.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-27 Sat 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>lavfi live oscilloscope</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">lavfi live oscilloscope</h1>
<p>
this pipeline turns your pulseaudio monitor into an oscilloscope using
ffmpeg, lavfi, and mpv
</p>

<pre class="example" id="org0000000">
ffmpeg -f pulse -i 0 -acodec copy -flags low_delay -fflags nobuffer -f wav - |
mpv - --config=no --alpha=no --mute -untimed --profile=low-latency \
--lavfi-complex='[aid1]asplit[ao][a1];[a1]avectorscope=r=25:m=lissajous_xy:bc=100:gc=100:rc=75:bf=255:gf=80:rf=255:zoom=1[vo]' \
</pre>

<p>
dispite all the low latency options stuck on there, there's still
around a half-second of latency. this can be squeezed down slightly by
using the seek bar in mpv to move it to the end, but even then there
is still slight latency
</p>
</div>
</body>
</html>
